app/views/movies/_form.html.erb

SELECT "genres".* FROM "genres"
---
      <li>
        <%= f.collection_check_boxes :genre_ids, Genre.all, :id, :name %>