app/controllers/favorites_controller.rb

INSERT INTO "favorites" ("created_at", "movie_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2014-10-13 23:27:44.297574"], ["movie_id", 2], ["updated_at", "2014-10-13 23:27:44.297574"], ["user_id", 3]]
---
  def create
    @user = current_user
    @like = @user.favorite_movies << @movie

DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 15]]
SELECT  "favorites".* FROM "favorites"  WHERE "favorites"."user_id" = ? AND "favorites"."id" = ? LIMIT 1  [["user_id", 3], ["id", 15]]
---
  def destroy
    current_user.favorites.find(params[:id]).destroy