app/controllers/movies_controller.rb

SELECT  "favorites".* FROM "favorites"  WHERE "favorites"."user_id" = ? AND "favorites"."movie_id" = 2 LIMIT 1  [["user_id", 3]]
---
  def show
    @fans = @movie.fans
    @current_favorite = current_user.favorites.find_by(movie_id: @movie.id) if current_user

UPDATE "movies" SET "slug" = ?, "updated_at" = ? WHERE "movies"."id" = 6  [["slug", "batman-vs-godzilla-redux"], ["updated_at", "2014-10-20 05:07:51.636921"]]
---
  def update
    if @movie.update(movie_params)

SELECT  "movies".* FROM "movies"  WHERE "movies"."slug" = 'batman-vs-godzilla' LIMIT 1
---
  def set_movie
    @movie = Movie.find_by!(slug: params[:id])