app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("comment", "created_at", "movie_id", "stars", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["comment", "asdz"], ["created_at", "2014-09-29 21:10:05.706622"], ["movie_id", 6], ["stars", 3], ["updated_at", "2014-09-29 21:10:05.706622"], ["user_id", 3]]
---
  def create
    @review = @movie.reviews.new(review_params)
    # @review = @movie.reviews.new(user: current_user, review_params)
    @review.user = current_user
    if @review.save